# KNPerM Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..KNPerM Property
SymbolTypeId Class See Also
---
Symbol kN/m, indicating unit Kilonewtons per meter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KNPerM { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KNPerM As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KNPerM {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace